const MORSE_TABLE = {
    '.-':     'a',
    '-...':   'b',
    '-.-.':   'c',
    '-..':    'd',
    '.':      'e',
    '..-.':   'f',
    '--.':    'g',
    '....':   'h',
    '..':     'i',
    '.---':   'j',
    '-.-':    'k',
    '.-..':   'l',
    '--':     'm',
    '-.':     'n',
    '---':    'o',
    '.--.':   'p',
    '--.-':   'q',
    '.-.':    'r',
    '...':    's',
    '-':      't',
    '..-':    'u',
    '...-':   'v',
    '.--':    'w',
    '-..-':   'x',
    '-.--':   'y',
    '--..':   'z',
    '.----':  '1',
    '..---':  '2',
    '...--':  '3',
    '....-':  '4',
    '.....':  '5',
    '-....':  '6',
    '--...':  '7',
    '---..':  '8',
    '----.':  '9',
    '-----':  '0',
};

function decode(expr) {
   
        let decodedMessage = '';
    
        // Разделяем строку на группы по 10 символов
        for (let i = 0; i < expr.length; i += 10) {
            const morseCodeSegment = expr.slice(i, i + 10);  // Получаем подстроку длиной 10
    
            if (morseCodeSegment === '**********') {
                decodedMessage += ' '; // Обрабатываем пробелы 
            } else {
                // Декодируем символ: заменяем 10 на точку и 11 на тире
                const morseChar = morseCodeSegment.replace(/10/g, '.').replace(/11/g, '-').replace(/0/g, ''); // убираем лишние нули
                // Получаем символ из таблицы
                decodedMessage += MORSE_TABLE[morseChar] || ''; // Если символ не найден, добавляем пустую строку
            }
        }
    
        return decodedMessage;
    
}

module.exports = {
    decode
}